#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-4-auth-gateway/runs/run-uwR3rgE452vR4zTo

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_package: Refreshing...
data.archive_file.lambda_package: Refresh complete after 0s [id=01dafee32e968b211eb5c5b161f53ec78fe58966]
aws_api_gateway_rest_api.g35_microservices: Refreshing state... [id=d8ye0tikhc]
aws_cognito_user_pool.g35_microservices_pool: Refreshing state... [id=us-east-1_GZSrWFTD2]
aws_api_gateway_resource.root: Refreshing state... [id=p9chas]
aws_api_gateway_authorizer.g35_microservices: Refreshing state... [id=u0m1vk]
aws_cognito_user.example: Refreshing state... [id=us-east-1_GZSrWFTD2/new_test]
aws_cognito_user_pool_client.client: Refreshing state... [id=3e2h8el6u4oiqtrr5g1kn3r5af]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-d8ye0tikhc-p9chas-POST]
aws_api_gateway_method.options: Refreshing state... [id=agm-d8ye0tikhc-p9chas-OPTIONS]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-d8ye0tikhc-p9chas-OPTIONS]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-d8ye0tikhc-p9chas-OPTIONS-200]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-d8ye0tikhc-p9chas-POST-200]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-d8ye0tikhc-p9chas-OPTIONS-200]
aws_api_gateway_integration.options_integration: Drift detected (update)
aws_api_gateway_integration_response.options_integration_response: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "d8ye0tikhc"
      + stage_name    = "dev"
    }

  # aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "p9chas"
      + rest_api_id             = "d8ye0tikhc"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "p9chas" -> (known after apply)
      ~ id                      = "agi-d8ye0tikhc-p9chas-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (11 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.options_integration_response will be created
  + resource "aws_api_gateway_integration_response" "options_integration_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "p9chas"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "d8ye0tikhc"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.proxy will be created
  + resource "aws_api_gateway_integration_response" "proxy" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "p9chas"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "d8ye0tikhc"
      + status_code         = "200"
    }

  # aws_iam_role.g35_microservices_lambda_role will be created
  + resource "aws_iam_role" "g35_microservices_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "g35_microservices_lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "g35_microservices_lambda-role"
    }

  # aws_lambda_function.html_lambda will be created
  + resource "aws_lambda_function" "html_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "index.zip"
      + function_name                  = "g35_microservices_lf_successfull"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "7UiMzOby/p2L24TtW6pFaRfnXsU0T0lG8ko4qKTTQTs="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "g35_microservices_lf_successfull"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:471112887467:d8ye0tikhc/*/*/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*